Repository: SButterfly/FillingStation
Catalog: FillingStation/Localization/Strings.*.resx
Languages: ru

# Exception_pattern_place
source: Could't place pattern at this point.
ru: Невозможно поместить паттерн на координату

# Exception_point_is_not_on_path
source: Path doesn't contain this point
ru: Точка не принадлежит пути

# Exception_segment_count
source: Segment count must be from 1 to 4
ru: Количество сегментов должно быть от 1 до 4х

source: Cash box
ru: Касса

# CashBox_limit
source: Cash box's limit
ru: Лимит кассы:

source: Column
ru: Универсальная колонка

# InfoTable
source: Information board
ru: Информационное табло

# RoadIn
source: Enter
ru: Въезд

# RoadOut
source: Exit
ru: Выезд

source: Road
ru: Дорога

# RoadT
source: Сrossroad
ru: Перекресток

# RoadTurn
source: Turn
ru: Поворот

source: Tank
ru: Резервуар

# Tank_limit
source: Tank's limit:
ru: Лимит резервуара:

# Fuel_a92
source: A - 92
ru: АИ - 92

# Fuel_a95
source: A - 95
ru: АИ - 95

# Fuel_a98
source: A - 98
ru: АИ - 98

# Fuel_diesel
source: Diesel
ru: Дизельное топливо

# Casher
source: Collector
ru: Инкассатор

source: Tanker
ru: Дозаправщик

# Exception_missingClass
source: Could't create class of type.
ru: Невоможно сгенерировать тип заданного объекта

# Filename
source: Filling station
ru: Заправочная станция

# Filter_model
source: FS model
ru: Модели

# Filter_all
source: All
ru: Все файлы

# Exception_notRotaion
source: This are no rotation property
ru: Парамерт не является поворотом

# Exeption_DeterminRange
source: Determin range must be from 2 to 100
ru: Минимальное значение параметра детерминированного потока - 2 Максимальное значение параметра детерминированного потока - 100

# Exeption_Normal
source: There couldn't be such dx and mx.
ru: Неверное значение параметра dx нормального закона распределения при заданном mx

# Exception_NormalRange
source: mx must be from 2 to 100
ru: Минимальное значение параметра mx нормального закона распределения - 2 Максимальное значение параметра mx нормального закона распределения - 100

# Exception_UniformRange
source: Uniform range must be from 2 to 100
ru: Минимальное значение нижней границы равномерного закона распределения - 2 Максимальное значение верхней границы равномерного закона распределения - 100

# PropertyName
source: Name:
ru: Название:

source: Width
ru: Ширина

source: Height
ru: Высота

# Exception_WidthRangeFormat
source: Field's width must be from {0} to {1}. Field's height must be from {2} to {3}.
ru: Ширина поля должна варьироваться от {0} до {1}. Высота поля должна варьироваться от {2} до {3}.

# Exception_FSModelRangeFormat
source: Field's width must be from {0} to {1}. Field's height must be from {2} to {3}.
ru: Ширина поля должна варьироваться от {0} до {1}. Высота поля должна варьироваться от {2} до {3}.

# Exception_properyFormat
source: Mistake at: "{0}".
ru: Ошибка в параметре: "{0}". Проверьте корректность ввода.

# Exception_DB
source: An error proced in database!
ru: Ошибка при работе с БД!

# Car
source: User car
ru: пользовательская машина

# Exception_DB_singleDelete
source: There must be more than 1 record
ru: Нельзя удалить единственную запись!

# Exception_HtmlNotFoundFormat
source: There are no {0} files.
ru: Ошибка при открытии страницы: Файл {0} не существует.

# ModelTime
source: Simulation time:
ru: Модельное время:

# Cash_state
source: Cash box: {0} $
ru: Касса: {0} р

# Tank_a92_state
source: Tank (A92): {0} liters
ru: Резервуар (А92): {0} л

# Tank_a95_state
source: Tank (A95): {0} liters
ru: Резервуар (А95): {0} л

# Tank_a98_state
source: Tank (A98): {0} liters
ru: Резервуар (А98): {0} л

# Tank_diesel_state
source: Tank (Diesel): {0} liters
ru: Резервуар (Diesel): {0} л

# Exception_SimulationSpeed
source: Simulation speed wasn't write correctly.
ru: Скорость моделирования задана неверно.

# Exception_SimulationSpeedRange
source: Simulation speed must be more than {0} and no more than {1}.
ru: Скорость моделирования должна быть задана строго больше {0} и меньше {1}

# ProgramName
source: Filling Station simulation program
ru: Система моделирования работы АЗС

# Filename_noname
source: Noname
ru: Безымянный

source: Help
ru: Справка

source: Credits
ru: О разработчиках

# SaveProject
source: Project isn't saved. Save it?
ru: Проект не сохранен. Сохранить?

source: Attention
ru: Внимание!

# ExceptionMessage_Title
source: Error
ru: Произошла ошибка

# Exception_readFS
source: An error occurred while loading filling station.\n
ru: Ошибка при загрузке топологии.

# Construction_placeOnCell
source: Choose cell. <ESC> to cancel
ru: Выберите подходящую клетку. <ESC> для выхода из режима.

# Construction_placeOnNewCell
source: Replace to another cell.
ru: Переместите на новую клетку.

# Exception_Generator
source: There is an error on creating car stream:
ru: Ошибка при создании потока:

# Exception_GeneratorNotChoosen
source: You should choose some stream before continue
ru: Поток не выбран

# Exception_FSModelCorrectnessFormat
source: There must be exactly {0} «{1}».
ru: В топологии должен присутствовать ровно {0} шаблон(а) «{1}».

# Exception_FSModelCorrectness_TankRange
source: Tank's limit must be from 10 000 to 20 000.
ru: Параметры объема резервуара должны быть заданы в пределах от 10000 до 20000.

# Exception_FSIsIncorrect
source: Filling station is incorrect. May be not all roads are connected.
ru: Данная топология АЗС некорректна. Возможно, не все дороги связаны

# Exception_FSModelCorrectness_RoadInOut
source: Enter pattern must be before Exit pattern.
ru: Шаблон «Въезд» должен располагаться раньше шаблона «Выезд».

# Exception_FSModelCorrectness_PatternMainRoadFormat
source: «{0}» does not connected to main road.
ru: «{0}» не соединен с главной дорогой.

# Exception_FSModelCorrectness_CashRangeFormat
source: Cash box's limit must be from 500 000 to 1 500 000.
ru: У шаблона «Касса» параметр лимита должен быть задан в пределах от 500 000 до 1 500 000.

# Tank_fuel_field
source: Fuel type:
ru: Тип топлива:

# Exception_ExponentialRange
source: Y must be from 0.001 to 0.5
ru: Минимальное значение параметра Y показательного закона распределения - 0.01 Максимальное значение параметра Y показательного закона распределения - 0.5

source: Model:
ru: Модель:

source: Image:
ru: Изображение:

# TankVolume
source: Tank's volume
ru: Объем бака:

# CarSizeType
source: Car:
ru: Тип автомобиля:

source: Fuel type:
ru: Тип топлива:

# NextRecord
source: Next
ru: Следующая запись

# PreviousRecord
source: Back
ru: Предыдущая запись

# SaveRecord
source: Save
ru: Сохранить изменения

# AddRecord
source: Add
ru: Вставить запись

# DeleteRecord
source: Delete
ru: Удалить запись

# CarsTitle
source: Cars
ru: Автомобили

# FSSettingsTitle
source: Filling station
ru: Создание АЗС

# FieldSettings
source: Field's settings
ru: Настройки поля

source: Create
ru: Создать

source: Cancel
ru: Отмена

# FuelTitle
source: Fuel
ru: Топливо

# PricePerLiter
source: Liter price
ru: Цена за литр

# SimulationTitle
source: Simulation
ru: Моделирование

source: Manually
ru: Пользовательская

# FSState
source: State
ru: Состояние АЗС

source: File
ru: Файл

source: Open
ru: Открыть

source: Save
ru: Сохранить

source: Save as
ru: Сохранить как

source: Close
ru: Закрыть

source: Simulation
ru: Моделирование

source: Data
ru: Данные

source: Cars
ru: Автомобили

source: Fuel
ru: Топливо

source: About
ru: О программе

# CarStreamSettingsTitle
source: Car stream
ru: Настройкa потока автомобилей

# Determin
source: Deterministic
ru: Детерминированный

source: Normal
ru: Нормальный

source: Exponential
ru: Показательный

source: Uniform
ru: Равномерный

# Determin_dt
source: ΔT (sec):
ru: ΔT (сек):

# Normal_mx
source: mx (sec):
ru: mx (сек):

# Normal_dx
source: dx (sec^2):
ru: dx (сек^2):

# Normal_y
source: y (1/sec):
ru: y (1/сек):

# Uniform_a
source: a (sec):
ru: a (сек):

# Uniform_b
source: b (sec):
ru: b (сек):

# SettingsTitle
source: Properties
ru: Свойства

# Exception_FSModelCorrectness_PatternsNotUsed
source: Some roads are not available for vehicles. Probably, there are some loops on FS.
ru: Не все дороги доступны для заезда автомобилей. Возможно, существуют круги.

source: Turn:
ru: Повернуть:

# Exception_cashNearRoad
source: Cash box must be near road.
ru: Касса должна находиться рядом с дорогой.

# Tank_fuel_critical
source: Critical fuel level:
ru: Критический уровень топлива:

# Tank_fuel_low
source: Low fuel level:
ru: Низкий уровень топлива:

# Exception_FSModelCorrectness_TankLimitRangeFormat
source: {0}'s tank limit must be from {1} to {2}.
ru: Лимит {0} резервуара должен быть от {1} до {2}.

# Exception_FSModelCorrectness_LowTankLimitFormat
source: {0}'s low tank limit must be from {1} to limit.
ru: Низкий уровень {0} резервуара должен быть от {1} до лимита.

# Exception_FSModelCorrectness_CriticalTankLimitFormat
source: {0}'s tank limit must be from {1} to critical
ru: Критический уровень {0} резервуара должен быть от {1} до низкого.

# FSStatistics
source: Statistics
ru: Статистика

# AVG_CarCount
source: AVG count of cars: {0}
ru: Среднее количество машин на АЗС: {0}

# AVG_CarToFSFormat
source: Percentage of cars which entered FS: {0} %
ru: Процент машин, заехавших на АЗС: {0} %

# AVG_CarTimeFormat
source: AVG service time: {0} sec
ru: Среднее время машины на АЗС: {0} сек

# AVG_CarFillingTimeFormat
source: AVG filling time: {0} sec
ru: Среднее время заправки: {0} $

# AVG_CarFillingCashFormat
source: AVG filling check: {0} $
ru: Средний размер чека: {0} $

# AVG_CarFillingTankFormat
source: AVG filling tank: {0} liters
ru: Средний объем заправляемого топлива: {0} l

# AVG_CarServiceCarWaiting
source: AVG inter-arrival time of:
ru: Среднее время между прибытиями:

# AVG_CarTank92Format
source: - tanker (A92): {0} sec
ru: - дозаправщика (A92): {0} sec

# AVG_CarTank95Format
source: - tanker (A95): {0} sec
ru: - дозаправщика (A95): {0} sec

# AVG_CarTank98Format
source: - tanker (A98: {0} sec
ru: - дозаправщика (A98: {0} sec

# AVG_CarTankDieselFormat
source: - tanker (Diesel): {0} sec
ru: - дозаправщика (Diesel): {0} sec

# AVG_CarCasherFormat
source: - collector: {0} sec
ru: - инкассация: {0} sec

# Exception_writeFS
source: An error occurred while saving filling station.\n
ru: Произошла ошибка во время записи файла: \n

source: Settings
ru: Настройки

# FuelConsumptionSettingsTitle
source: Fuel consumption settings
ru: Настройка расхода топлива

source: Car percentage, %
ru: Доля автомобилей, %

# FillingVolume
source: Filling volume, liters
ru: Объем заправки, л

# PricePerLitter
source: Price per liter, $
ru: Цена за литр, руб

# Exception_SumPercentage
source: Sum of all percentages must equals 100%
ru: Доли автомобилей должны в сумме давать 100%.

# Exception_FuelPriceFormat
source: Price must be from {0} to {1}.
ru: Цена должна находиться в интервале ({0}; {1}].

# Exception_FillingVolumeFormat
source: Filling tank volume must be from {0} to {1}.
ru: Объем заправляемого топлива должен находиться в интервале ({0}; {1}].

# Exception_PercentageMustBeNonNegativeValue
source: Percent couldn't be less than 0.
ru: Процент должен быть неотрицательным.
